```
  # github_branch_protection.repo["octodns-edgecenter"] will be created
  + resource "github_branch_protection" "repo" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_repository.repo["octodns-edgecenter"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "EdgeCenter provider for octoDNS"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "octodns-edgecenter"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
    }

  # github_repository_tag_protection.repo["octodns-edgecenter"] will be created
  + resource "github_repository_tag_protection" "repo" {
      + id                = (known after apply)
      + pattern           = "v*"
      + repository        = "octodns-edgecenter"
      + tag_protection_id = (known after apply)
    }

  # github_team_repository.review["octodns-edgecenter"] will be created
  + resource "github_team_repository" "review" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "octodns-edgecenter"
      + team_id    = "5532035"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```